---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SolidCurveIntersectionOptions
source: html/ce054463-24ae-c557-85ad-447d5e5f5354.htm
---
# SolidCurveIntersectionOptions Members

Constructs a new SolidCurveIntersectionMode with default settings.